IDEA Open Model
OpenModel.AddObject Method (OpenElementId)
Compatible with IDEA StatiCa Beta 20.0
 Add new object into collections
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public int AddObject(
	OpenElementId obj
)
Public Function AddObject (
	obj As OpenElementId
) As Integer
Parameters
obj
Type: IdeaRS.OpenModel.OpenElementId
Added object
Return Value
Type: Int32
Return value 0 - OK, -1 - duplicit Id, -10 - the type of object there is not in the data colections
Remarks
 If the obj.Id is set to zero or lesser, this method finds the first available free Id and sets it into the obj.Id.
See Also
Reference
OpenModel Class
AddObject Overload
IdeaRS.OpenModel Namespace